// tmi 출력
// 랜덤 문장 배열
const randomSentences = [
	"개과 동물 중 멍멍하는건 개밖에 없다.",
    "개도 터널등을 지날 때 귀가 멍멍해진다.",
    "개는 똥을 쌀 때 지구 자기장 축 방향에 맞춰 싼다.",
    "개들은 자기와 비슷한 음역대를 가진 음악을 좋아한다고 한다.",
    "강아지는 냄새로 시간을 느낀다.",
    "개는 뒷다리 구조 상 발가락으로 걸어다닌다.",
    "개가 등을 보여주는건 신뢰한다는 의미이다.",
    "개가 견주의 몸에 다리를 올리는 해동은 우위의식을 뜻한다.",
    "개의 시력은 0.3정도이다.",
    "개는 평균족으로 150~200개의 단어를 기억할 수 있다.",
    "개들도 스트레스를 받으면 새치가 난다.",
    "안겨있는 개가 손을 핥는 이유는 놔달라는 부탁의 뜻이다.",
    "개가 긴장했을 때 주인이 심호흡을 하면 긴장완화 효과가 있다.",
    "고음은 개를 움직이게 하고 저음은 멈추게 한다.",
    "겁이 많은 개에게는 느리게 행동해주는 것이 좋다.",
    "인기 있는 반려견 이름 1위는 코코다.",
    "개도 가끔 주인을 못알아본다!",
    "털이 곱슬인 말티즈가 은근히 많다.",
    "개는 일광욕을 즐긴다.",
    "고양이에게는 유당의 소화를 돕는 효소가 없다.",
    "고양이가 살짝 깨무는 것은 애정표현이다.",
    "고양이는 안전하고 편안한 곳에서만 식빵을 굽는다.",
    "고양이의 스크래쳐에는 반가움과 애정의 표현도 담겨있다.",
    "고양이가 집사에게 엉덩이를 들이대는 것은 애정표현이다.",
    "개가 달달 떠는 것은 대부분 스트레스 때문이다.",
    "개도 스트레스 받으면 탈모가 온다.",
    "고양이들은 주인의 해동을 관찰해 배운다.",
    "고양이는 자기 키의 5배 높게 점프할 수 있다.",
    "고양이는 냄새를 맡을 수 있다.",
    "고양이의 눈 색깔은 성장하며 변한다.",
    "고양이의 단기기억력은 15분이다.",
    "고양이는 발자국이 일렬도 찍힌다.",
    "고양이는 그루밍을 통해 체온을 조절 한다.",
    "햄스터의 앞니는 평생동안 자라서 견과류로 이갈이를 해줘야 한다.",
    "햄스터는 당황하면 똥오줌을 싼다.",
    "햄스터는 새가슴이라 잘 놀란다.",
    "햄스터는 한 케이지당 한마리만 키워야 한다.",
    "햄스터에서 말리지 않은 과일을 먹이면 설사를 유발한다.",
    "햄스터는 나이를 먹을수록 귀가 커진다.",
    "토끼는 성대가 퇴화되어, 코와 목의 울림으로 소리를 낸다.",
    "토끼는 점프할 때 꼬리로 균형을 잡는다.",
    "토끼는 매우 미식가이고, 편식이 심하다.",
    "토끼는 1시간에 10~20회 정도 깜빡인다.",
    "토끼는 양쪽 귀를 따로 움직일 수 있다.",
    "고양이는 유대를 표현하기 위해 서로 꼬리를 감는다.",
    "강이지의 코는 사람의 지문처럼 다 다르게 생겼다.",
    "고양이는 머쓱하면 그루밍을 하기도 한다.",
    "토끼는 기분이 좋으면 엉덩이를 씰룩거린다.",
    "강아지는 밥주는 사람보다 산책 시켜주는 사람을 더 좋아한다.",
    "강아지는 태어난 후 한 달 반이 지날 때 까진 꼬리 흔드는 방법을 모른다.",
    "개들을 자기와 비슷한 음역대를 가진 음악을 좋아한다고 한다.",
    "고양이에게는 유당의 소화를 돕는 효소가 없다.",
    "고양이는 인간을 몸집이 크면서도 공격성이 없는 다른 고양이라고 인식한다.",
    "견주가 우울해하면 반려견도 우울해진다."
];

// 랜덤 문장 선택
const randomIndex = Math.floor(Math.random() * randomSentences.length);
const randomSentence = randomSentences[randomIndex];

// "randomTmi" id를 가진 요소를 선택
const tmiDiv = document.getElementById('randomTmi');

// 찾은 div에 랜덤 문장 설정
tmiDiv.textContent = randomSentence;